meat-plant/ssl/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЖивотных</xr:Item>
				<xr:Item>AccumulationRegister.Поставки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНакладной</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНакладной</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склад</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Название</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Животные</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Сырье</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщийВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

meat-plant/ssl/Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Типы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логотип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтрагентыПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

meat-plant/ssl/Documents/ПриходнаяНакладная/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.ПриходнаяНакладная.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриходнаяНакладная.ВидНакладной КАК ВидНакладной,
	|	ПриходнаяНакладная.Дата КАК Дата,
	|	ПриходнаяНакладная.Контрагент КАК Контрагент,
	|	ПриходнаяНакладная.Номер КАК Номер,
	|	ПриходнаяНакладная.Оплата КАК Оплата,
	|	ПриходнаяНакладная.Склад КАК Склад,
	|	ПриходнаяНакладная.Сведения.(
	|		НомерСтроки КАК НомерСтроки,
	|		Название КАК Название,
	|		Количество КАК Количество,
	|		ОбщийВес КАК ОбщийВес,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	) КАК Сведения,
	|	Контрагенты.ОтветственноеЛицо КАК ОтветственноеЛицо,
	|	Контрагенты.Логотип КАК Логотип,
	|	Контрагенты.ОтветственноеЛицо.Подпись КАК Подпись
	|ИЗ
	|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ПриходнаяНакладная.Контрагент = Контрагенты.Ссылка
	|ГДЕ
	|	ПриходнаяНакладная.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСведенияШапка = Макет.ПолучитьОбласть("СведенияШапка");
	ОбластьСведения = Макет.ПолучитьОбласть("Сведения");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;   
		
		// Вывод логотипа
		Если НЕ Выборка.Логотип.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Логотип);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаЛоготип = Новый Картинка(ДвоичныеДанные);
				ОбластьЗаголовок.Рисунки.Логотип.Картинка = КартинкаЛоготип;
			КонецЕсли;
		КонецЕсли;    
		Если НЕ Выборка.Подпись.Пустая() Тогда
		ДвоичныеДанные = РаботаСФайлами.ДвоичныеДанныеФайла(Выборка.Подпись);
			Если ЗначениеЗаполнено(ДвоичныеДанные) Тогда
				КартинкаПодпись = Новый Картинка(ДвоичныеДанные);
				Подвал.Рисунки.Подпись.Картинка = КартинкаПодпись;
			КонецЕсли;
		КонецЕсли;

		
        Номер = Выборка.Номер;
		Дата = Выборка.Дата;
		ОбластьЗаголовок.Параметры.Номер = Номер; 
		ОбластьЗаголовок.Параметры.Дата = Дата;
		ТабДок.Вывести(ОбластьЗаголовок);
        ТекПользователь = Выборка.ОтветственноеЛицо;
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
        СуммаИтог = 0;
		ТабДок.Вывести(ОбластьСведенияШапка);
		ВыборкаСведения = Выборка.Сведения.Выбрать();
		Пока ВыборкаСведения.Следующий() Цикл
			ОбластьСведения.Параметры.Заполнить(ВыборкаСведения);
			ТабДок.Вывести(ОбластьСведения, ВыборкаСведения.Уровень());
			СуммаИтог = СуммаИтог + ВыборкаСведения.Сумма;
		КонецЦикла;
  		Подвал.Параметры.Ответственный = ТекПользователь;
		Подвал.Параметры.ВсегоПоДокументу = Строка(СуммаИтог) + " ₽";
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
